app/views/confessions/show.html.haml

	%b Tags:
	- @confession.tags.each do |tag|
---
SELECT `tags`.* FROM `tags` INNER JOIN `confessions_tags` ON `tags`.`id` = `confessions_tags`.`tag_id` WHERE `confessions_tags`.`confession_id` = 1

				before commenting
		- @confession.comments.each do |comment|
			%li
				= time_ago_in_words(comment.created_at)
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`confession_id` = 2
INSERT INTO `comments` (`comment`, `confession_id`, `created_at`, `updated_at`, `user_id`) VALUES (NULL, 2, '2011-08-07 08:14:53', '2011-08-07 08:14:53', NULL)