app/controllers/comments_controller.rb

SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 5 LIMIT 1
---
  def show
    @comment = Comment.find(params[:id])

SELECT `confessions`.* FROM `confessions` WHERE `confessions`.`id` IS NULL LIMIT 1
INSERT INTO `comments` (`comment`, `confession_id`, `created_at`, `updated_at`, `user_id`) VALUES ('ciao', NULL, '2011-08-07 16:34:51', '2011-08-07 16:34:51', NULL)
---
  def create
    @comment = Comment.new(params[:comment])
    @comment.user = current_user
    @confession = Confession.find_by_id(params[:confession_id])

    respond_to do |format|
      if @comment.save

SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 5 LIMIT 1
UPDATE `comments` SET `comment` = 'prova', `updated_at` = '2011-08-07 08:17:45' WHERE `comments`.`id` = 5
---
  def update
    @comment = Comment.find(params[:id])

    respond_to do |format|
      if @comment.update_attributes(params[:comment])

SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1
---
  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy