app/controllers/confessions_controller.rb

SELECT `confessions`.* FROM `confessions`
---
  def index
    @confessions = Confession.all

SELECT `confessions`.* FROM `confessions` WHERE `confessions`.`id` = 1 LIMIT 1
UPDATE `confessions` SET `views` = 1, `updated_at` = '2011-08-07 03:08:28' WHERE `confessions`.`id` = 1
---
  def show
    @confession = Confession.find(params[:id])
		@confession.views += 1
		@confession.save

SELECT `tags`.* FROM `tags` WHERE `tags`.`name` = 'guns' LIMIT 1
INSERT INTO `confessions` (`created_at`, `down`, `feelings`, `transcript`, `up`, `updated_at`, `url`, `user_id`, `views`) VALUES ('2011-08-07 02:20:03', NULL, 'Guilty', 'I threw it to the ground!', NULL, '2011-08-07 02:20:03', 'http://youtu.be/gAYL5H46QnQ', NULL, NULL)
INSERT INTO `tags` (`created_at`, `name`, `updated_at`) VALUES ('2011-08-07 02:54:06', 'guns', '2011-08-07 02:54:06')
---
  def create
    @confession = Confession.new(params[:confession])
    @confession.user = current_user if current_user?

    params[:tags].split.each do |tag|

	  	if Tag.find_by_name(tag).nil?
	  		tag = Tag.new(:name=>tag)
	  	else
	  		tag = Tag.find_by_name(tag)
	  	end
	  	@confession.tags << tag

SELECT `confessions`.* FROM `confessions` WHERE `confessions`.`id` = 2 LIMIT 1
UPDATE `confessions` SET `down` = 1, `updated_at` = '2011-08-07 03:20:11' WHERE `confessions`.`id` = 2
---
  def update
    @confession = Confession.find(params[:id])

    respond_to do |format|
      if @confession.update_attributes(params[:confession])