app/controllers/site_controller.rb

  def index
 		@latest = Confession.order('created_at DESC').limit(5)
 		@top = Confession.order('views DESC').limit(5)
---
SELECT `confessions`.* FROM `confessions` ORDER BY created_at DESC LIMIT 5
SELECT `confessions`.* FROM `confessions` ORDER BY views DESC LIMIT 5